m = int(input('Введите номер месяца '))

dict_m = {1: 'январь', 2: 'февраль', 3: 'март', 4: 'апрель', 5: 'май', 6: 'июнь',
          7: 'июль', 8: 'август', 9: 'сентябрь', 10: 'октябрь', 11: 'ноябрь', 12: 'декабрь'}

list_m = ('январь', 'февраль', 'март', 'апрель', 'май', 'июнь',
          'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь')

dict_s = {1: 'зима', 2: 'весна', 3: 'лето', 4: 'осень'}
list_s = ('зима', 'весна', 'лето', 'осень')

if m in [1, 2, 12]:
    print(dict_m[m], list_m[m-1], dict_s[1], list_s[0])
elif m in [3, 4, 5]:
    print(dict_m[m], list_m[m-1], dict_s[2], list_s[1])
elif m in [6, 7, 8]:
    print(dict_m[m], list_m[m-1], dict_s[3], list_s[2])
elif m in [9, 10, 11]:
    print(dict_m[m], list_m[m-1], dict_s[4], list_s[3])
else:
    print('нет такого месяца')

